app/views/messages/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
---
      <% if message.body %>
        <% user = User.find(message.user_id) %>