app/views/notes/best.html.erb

SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 27], ["id", 5], ["LIMIT", 1]]
---
          <% if current_user != note.user %>
            <% if current_user && current_user.favourite_notes.include?(note) %>

SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" = ? ORDER BY "note_topics"."id" ASC LIMIT ?  [["note_id", 2], ["LIMIT", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" = ? ORDER BY "note_tags"."id" ASC LIMIT ?  [["note_id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  <% @topic_ids_union.each_with_index do |topic_id, index| %>
    <% topic = Topic.find(topic_id) %>
    <% tag = Tag.find(@tag_ids_union[index]) %>

SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 27], ["id", 5], ["LIMIT", 1]]
---
          <% if current_user != note.user %>
            <% if current_user && current_user.favourite_notes.include?(note) %>