app/views/notes/edit.html.erb

            <ul class="options-list1">
              <% Tag.all.each do |tag| %>
---
SELECT "tags".* FROM "tags"

                  <div class="tag-all check">
                    <%= check_box_tag "note[tag_ids][]", tag.id, @note.tags.include?(tag) %>
---
SELECT 1 AS one FROM "tags" INNER JOIN "note_tags" ON "tags"."id" = "note_tags"."tag_id" WHERE "note_tags"."note_id" = ? AND "tags"."id" = ? LIMIT ?  [["note_id", 1], ["id", 1], ["LIMIT", 1]]

            <ul class="options-list2">
              <% Topic.all.each do |topic| %>
---
SELECT "topics".* FROM "topics"

                  <div class="topic-all check">
                    <%= check_box_tag "note[topic_ids][]", topic.id, @note.topics.include?(topic) %>
---
SELECT 1 AS one FROM "topics" INNER JOIN "note_topics" ON "topics"."id" = "note_topics"."topic_id" WHERE "note_topics"."note_id" = ? AND "topics"."id" = ? LIMIT ?  [["note_id", 1], ["id", 3], ["LIMIT", 1]]

          <%= f.label :faculty_id, "Facoltà", style: "color: white;" %>
          <%= f.collection_select :faculty_id, Faculty.all, :id, :name, prompt: "Seleziona una facoltà", style: "font-weight: bold;" %>
---
SELECT "faculties".* FROM "faculties"