app/views/notes/favourite.html.erb

            <p class="card-text"> Autore: <%= link_to note.user.username, user_path(note.user), class: 'link' %></p>
            <% added_to_favorites_at = current_user.favourites.find_by(note_id: note.id) %>
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ? LIMIT ?  [["user_id", 27], ["note_id", 3], ["LIMIT", 1]]

      <% @note_topics.each do |topic_id, note_topics| %>
        <% topic = note_topics.first.topic %>
---
SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

            <span class="truncated"><%= truncated_description %></span>
            <% if note_topic.note.description.length > 650 %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

              <p class="card-text"> Autore: <%= link_to note_topic.note.user.username, user_path(note.user), class: 'link' %></p>
              <% added_to_favorites_at = current_user.favourites.find_by(note_id: note.id) %>
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ? LIMIT ?  [["user_id", 27], ["note_id", 3], ["LIMIT", 1]]

      <% @note_tags.each do |tag_id, note_tags| %>
        <% tag = note_tags.first.tag %>
---
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

            <span class="truncated"><%= truncated_description %></span>
            <% if note_tag.note.description.length > 650 %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

              <p class="card-text"> Autore: <%= link_to note_tag.note.user.username, user_path(note.user), class: 'link' %></p>
              <% added_to_favorites_at = current_user.favourites.find_by(note_id: note.id) %>
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ? LIMIT ?  [["user_id", 27], ["note_id", 3], ["LIMIT", 1]]