app/views/notes/myNotes.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 24]]
---

<% current_user.notes.each do |note| %>