app/views/notes/new.html.erb

SELECT "tags".* FROM "tags"
---
                <ul class="options-list1">
                  <% Tag.all.each do |tag| %>

SELECT "topics".* FROM "topics"
---
                <ul class="options-list2">
                  <% Topic.all.each do |topic| %>

SELECT "faculties".* FROM "faculties"
---
              <label for="faculty_id" style="color:white;">Facoltà</label>
              <%= form.collection_select :faculty_id, Faculty.all, :id, :name, prompt: "Seleziona una facoltà",style: "font-weight: bold;"%>

SELECT "tags".* FROM "tags"
---
                <ul class="options-list1">
                  <% Tag.all.each do |tag| %>

SELECT "topics".* FROM "topics"
---
                <ul class="options-list2">
                  <% Topic.all.each do |topic| %>

SELECT "faculties".* FROM "faculties"
---
            <label for="faculty_id " class="fw-bold" style="color:white;">Facoltà</label>
            <%= form.collection_select :faculty_id, Faculty.all, :id, :name, prompt: "Seleziona una facoltà",style: "font-weight: bold;"%>