app/views/notes/new.html.erb

              <label>
                <%= check_box_tag "note[tag_ids][]", tag.id, @note.tags.include?(tag) %>
---
SELECT "tags".* FROM "tags"

              <label>
                <%= check_box_tag "note[topic_ids][]", topic.id, @note.topics.include?(topic) %>
---
SELECT "topics".* FROM "topics"

    <label for="faculty_id">Facoltà</label>
    <%= form.collection_select :faculty_id, Faculty.all, :id, :name, prompt: "Seleziona una facoltà"%>
---
SELECT "faculties".* FROM "faculties"