app/views/notes/recenti.html.erb

          <% if current_user != visualizzazione.note.user %>
            <% if current_user && current_user.favourite_notes.include?(visualizzazione.note) %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]