app/views/notes/search.html.erb

SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 27], ["id", 3], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE (name LIKE '%%') AND (uploaded_at >= '2019-01-01 00:00:00') AND (uploaded_at <= '2020-01-01 23:59:59.999999') ORDER BY name ASC
---
          <p class="card-text"> Autore: <%= note.user.username %></p>
          <% if current_user && current_user.favourite_notes.include?(note) %>