app/views/notes/search.html.erb

SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 27], ["id", 3], ["LIMIT", 1]]
---
          <% if current_user != note.user %>
            <% if current_user && current_user.favourite_notes.include?(note) %>