app/views/notes/show.html.erb

    <% if current_user != @note.user %>
      <% if current_user && current_user.favourite_notes.include?(@note) %>
---
SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 25], ["id", 3], ["LIMIT", 1]]

          <%= inline_svg_tag("eye-fill.svg", class: "w-8 h-8") %>
          <p><%= @note.visualizzaziones.count %></p>
---
SELECT COUNT(*) FROM "visualizzaziones" WHERE "visualizzaziones"."note_id" = ?  [["note_id", 6]]

            <ul class="list-unstyled tags-topics-list">
              <% @note.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "note_tags" ON "tags"."id" = "note_tags"."tag_id" WHERE "note_tags"."note_id" = ?  [["note_id", 1]]

            <ul class="list-unstyled tags-topics-list">
              <% @note.topics.each do |topic| %>
---
SELECT "topics".* FROM "topics" INNER JOIN "note_topics" ON "topics"."id" = "note_topics"."topic_id" WHERE "note_topics"."note_id" = ?  [["note_id", 1]]

          <div class="chart">
            <%= pie_chart CreateRating.where(note_id: @note.id).group(:rating).count, width: "200px", height: "200px",
            donut: true, empty: "Non ci sono valutazioni"%>
---
SELECT COUNT(*) AS count_all, "create_ratings"."rating" AS create_ratings_rating FROM "create_ratings" WHERE "create_ratings"."note_id" = ? GROUP BY "create_ratings"."rating"  [["note_id", 1]]

        <h2 class="fw-bold h2_Comment" style="color:black;">Commenti:</h2>
        <% @note.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."note_id" = ?  [["note_id", 1]]

        <div class="grid-child-posts">
          <%= count = Note.where(user_id: @note.user.id).count%>
---
SELECT COUNT(*) FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 24]]

      <% conversation_id = nil %>
      <% Conversation.all.each do |conver| %>
---
SELECT "conversations".* FROM "conversations"