app/views/notes/show.html.erb

          <div class="chart">
            <%= pie_chart CreateRating.where(note_id: @note.id).group(:rating).count, width: "200px", height: "200px",
            donut: true, empty: "Non ci sono valutazioni"%>
---
SELECT COUNT(*) AS count_all, "create_ratings"."rating" AS create_ratings_rating FROM "create_ratings" WHERE "create_ratings"."note_id" = ? GROUP BY "create_ratings"."rating"  [["note_id", 10]]

<script>
  $(document).ready(function() {
    $("#message-btn").click(function(event) {
      event.preventDefault();
      const message_section = document.getElementById("message-section");

      var senderId = <%= current_user.id %>; // Inserisci qui il modo per ottenere l'ID dell'utente corrente
      var recipientId = <%= @note.user.id %>; // Inserisci qui il modo per ottenere l'ID dell'utente destinatario

      <% conversation_id = nil %>
      <% Conversation.all.each do |conversation| %>
          if (<%= conversation.sender_id == current_user.id %> && <%= conversation.recipient_id %> == recipientId){
              <% conversation_id = conversation.id %>;
            }
      <% end %>

      var url ="/conversations/" + <%= conversation_id %> + "/messages"

      $.ajax({
        url: url,
        method: "GET",
        success: function(responseHTML) {
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 24], ["LIMIT", 1]]