app/views/notes/suggested.html.erb

SELECT "notes".* FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ?  [["user_id", 27]]
SELECT 1 AS one FROM "notes" INNER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" INNER JOIN "note_tags" ON "note_tags"."note_id" = "notes"."id" WHERE (note_topics.topic_id IN (19,19) OR note_tags.tag_id IN (19,20)) AND "notes"."id" NOT IN (?, ?) AND "notes"."user_id" != ? LIMIT ?  [["id", 3], ["id", 5], ["user_id", 27], ["LIMIT", 1]]
---
          <% if current_user != note.user %>
            <% if current_user && current_user.favourite_notes.include?(note) %>