app/admin/dashboard.rb

SELECT "users".* FROM "users"
---

  content title: proc { I18n.t("active_admin.dashboard") } do
    panel "Utenti registrati" do
      table_for User.all do

SELECT "tags".* FROM "tags"
---
    end

    panel "Tags" do
      table_for Tag.all do

SELECT "richiesta_admins".* FROM "richiesta_admins"
---
    end

    panel "Richeste admin" do
      table_for RichiestaAdmin.all do