app/views/users/show.html.erb

  <div class="chart">
    <%= pie_chart(Note.where(user_id: @user.id).group(:rating).count)  %>
---
SELECT COUNT(*) AS count_all, "notes"."rating" AS notes_rating FROM "notes" WHERE "notes"."user_id" = ? GROUP BY "notes"."rating"  [["user_id", 15]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 15]]

        <% if current_user != note.user %>
            <% if current_user && current_user.favourite_notes.include?(note) %>
---
SELECT 1 AS one FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 27], ["id", 2], ["LIMIT", 1]]