app/views/pages/home.html.erb

UPDATE "users" SET "updated_at" = ?, "first_login" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 17:07:15.985946"], ["first_login", 1], ["id", 25]]
---
              <h1 class="display-4" id="messaggio_login" style="color: white;">Benvenuto <%= current_user.username %> su ShareYourNotes</h1>
              <% current_user.update(first_login: true) %>

SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "notes".* FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ?  [["user_id", 24]]
SELECT DISTINCT "notes".* FROM "notes" INNER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" INNER JOIN "note_tags" ON "note_tags"."note_id" = "notes"."id" WHERE (note_topics.topic_id IN (19,19) OR note_tags.tag_id IN (19,20)) AND "notes"."id" NOT IN (?, ?) AND "notes"."user_id" != ?  [["id", 3], ["id", 5], ["user_id", 27]]
---
                    <%=  if user_signed_in?
                    favourite = current_user.favourite_notes.includes(:note_topics, :note_tags)
                          favourite_topics = favourite.flat_map(&:note_topics).map(&:topic_id)
                          favourite_tags = favourite.flat_map(&:note_tags).map(&:tag_id)

                          @suggested_notes = Note.joins(:note_topics, :note_tags)
                         .where('note_topics.topic_id IN (?) OR note_tags.tag_id IN (?)', favourite_topics, favourite_tags)
                         .where.not(id: favourite.pluck(:id))
                         .where.not(user_id: current_user.id)
                         .distinct

SELECT "notes".* FROM "notes" ORDER BY "notes"."rating" DESC LIMIT ?  [["LIMIT", 10]]
---
                  <script>
                    <%=
                        @best_notes = Note.order(rating: :desc).limit(10) %>

SELECT "users".* FROM "users" ORDER BY "users"."rating" DESC LIMIT ?  [["LIMIT", 5]]
---
                  <script>
                    <%=  @best_users = User.order(rating: :desc).limit(5)