app/controllers/comments_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "note_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "Bellissimi appunti, spiegazione precisa e dettagliata."], ["note_id", 3], ["created_at", "2023-09-01 17:53:20.454779"], ["updated_at", "2023-09-01 17:53:20.454779"], ["user_id", 25]]
---
    def create
      @note = Note.find(params[:note_id])
      @comment = @note.comments.build(comment_params)
      @comment.user = current_user
      @comment.content = params[:comment][:content]
      if @comment.save