app/controllers/conversations_controller.rb

    def create
      if Conversation.between(params[:sender_id],params[:recipient_id]).present?
        @conversation = Conversation.between(params[:sender_id],
        params[:recipient_id]).first
---
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '24' AND conversations.recipient_id ='15') OR (conversations.sender_id = '15' AND conversations.recipient_id ='24'))
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '24' AND conversations.recipient_id ='15') OR (conversations.sender_id = '15' AND conversations.recipient_id ='24')) ORDER BY "conversations"."id" ASC LIMIT ?  [["LIMIT", 1]]

    def create_ajax
      if Conversation.between(params[:sender_id],params[:recipient_id]).present?
        @conversation = Conversation.between(params[:sender_id],
        params[:recipient_id]).first
      else
        @conversation = Conversation.create!(conversation_params)
---
SELECT 1 AS one FROM "conversations" WHERE "conversations"."sender_id" = ? AND "conversations"."recipient_id" = ? LIMIT ?  [["sender_id", 24], ["recipient_id", 15], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = '24' AND conversations.recipient_id ='15') OR (conversations.sender_id = '15' AND conversations.recipient_id ='24'))
INSERT INTO "conversations" ("sender_id", "recipient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sender_id", 24], ["recipient_id", 15], ["created_at", "2023-09-04 15:16:05.943980"], ["updated_at", "2023-09-04 15:16:05.943980"]]