app/controllers/messages_controller.rb

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = ? LIMIT ?  [["id", 144], ["LIMIT", 1]]
---
class MessagesController < ApplicationController
    before_action do
     @conversation = Conversation.find(params[:conversation_id])

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = ?  [["conversation_id", 144]]
---
  def index
   @messages = @conversation.messages
    if @messages.length > 10

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
   @message = @conversation.messages.new(message_params)
   if @message.save