app/controllers/notes_controller.rb

  def favourite
    @favourite_notes = current_user.favourite_notes.includes(:note_topics, :note_tags)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?, ?, ?, ?, ?)  [["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" IN (?, ?)  [["id", 1], ["id", 2]]

  def remove_favourite
    note = Note.find(params[:note_id])
    current_user.favourite_notes.delete(note)
---
DELETE FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ?  [["user_id", 21], ["note_id", 7]]

  def show
    @note = Note.find(params[:id])
    @comment = Comment.new

    if (@visualizzazione = Visualizzazione.find_by(note_id: @note.id, user_id: current_user.id)) == nil
      @note.visualizzaziones.create(user: current_user)
    end

    @note.increment_view_count
---
INSERT INTO "notes" ("name", "description", "created_at", "updated_at", "google_drive_link", "uploaded_at", "user_id", "faculty_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "last_seen" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 17:12:26.078512"], ["last_seen", "2023-09-01 17:12:26.077460"], ["id", 25]]

  def create
    @note = Note.new(note_params)
    @note.user = current_user
    @note.tags = Tag.where(id: params[:note][:tag_ids])
    @note.topics = Topic.where(id: params[:note][:topic_ids])
    file = params[:file]
    filename = file.original_filename
    tempfile = file.tempfile

    session = GoogleDrive::Session.from_config("config.json")
    destination_folder = session.collection_by_url("https://drive.google.com/drive/folders/1zJPM2hoIzMzuvfefRvQM8NXHee5pOfhL?hl=it")
    uploaded_file = destination_folder.upload_from_file(tempfile.path,filename,convert: false)



    if uploaded_file
          file_url = uploaded_file.human_url
          @note.google_drive_link = file_url


          @note.faculty_id = params[:note][:faculty_id] unless params[:note][:faculty_id].blank?


          if @note.tags.length > 0 && @note.topics.length > 0 && @note.faculty_id != nil

            if @note.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 24], ["LIMIT", 1]]
INSERT INTO "note_tags" ("note_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_id", 1], ["tag_id", 2], ["created_at", "2023-09-01 08:52:58.099795"], ["updated_at", "2023-09-01 08:52:58.099795"]]
INSERT INTO "note_topics" ("note_id", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_id", 1], ["topic_id", 4], ["created_at", "2023-09-01 08:52:58.101925"], ["updated_at", "2023-09-01 08:52:58.101925"]]
UPDATE "users" SET "updated_at" = ?, "last_seen" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 17:12:26.078512"], ["last_seen", "2023-09-01 17:12:26.077460"], ["id", 25]]