app/controllers/notes_controller.rb

  def favourite
    @favourite_notes = current_user.favourite_notes.includes(:note_topics, :note_tags)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?)  [["id", 3]]