app/controllers/notes_controller.rb

  def search
    @notes = Note.all

    if params[:search].present?
      @notes = @notes.where("name LIKE ?", "%#{params[:search]}%")
    end

    if params[:user_search].present?
      users = User.where("username LIKE ?", "%#{params[:user_search]}%")
      user_ids = users.pluck(:id)
      @notes = @notes.where(user_id: user_ids)
    end

    if params[:faculty].present?
      faculty = Faculty.find_by(id: params[:faculty])
      @notes = @notes.where(faculty: faculty)
    end

    if params[:topics].present?
      topic = params[:topics]
      topic_ids = Topic.where(name: topic).pluck(:id)
      @notes = @notes.joins(:note_topics).where(note_topics: { topic_id: topic_ids })
    end

    if params[:tags].present?
      tag = params[:tags]
      tag_ids = Tag.where(name: tag).pluck(:id)
      @notes = @notes.joins(:note_tags).where(note_tags: { tag_id: tag_ids })
---
SELECT "notes".* FROM "notes" WHERE (name LIKE '%%') AND (uploaded_at >= '2013-01-01 00:00:00') AND (uploaded_at <= '2019-01-01 23:59:59.999999') ORDER BY name DESC
SELECT "users"."id" FROM "users" WHERE (username LIKE '%Damiano%')
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? ORDER BY name ASC  [["user_id", 15]]
SELECT "faculties".* FROM "faculties"
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."faculty_id" = ? ORDER BY name ASC  [["user_id", 15], ["faculty_id", 3]]
SELECT "notes".* FROM "notes" INNER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" WHERE (name LIKE '%appunti%') AND "note_topics"."topic_id" = ? ORDER BY name DESC  [["topic_id", 1]]
SELECT "notes".* FROM "notes" INNER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" INNER JOIN "note_tags" ON "note_tags"."note_id" = "notes"."id" WHERE (name LIKE '%%') AND "note_topics"."topic_id" = ? AND "note_tags"."tag_id" = ? ORDER BY name ASC  [["topic_id", 1], ["tag_id", 3]]

  def favourite
    @favourite_notes = current_user.favourite_notes.includes(:note_topics, :note_tags)
    @note_topics = NoteTopic.where(note_id: @favourite_notes.pluck(:id)).group_by(&:topic_id)
    @note_tags = NoteTag.where(note_id: @favourite_notes.pluck(:id)).group_by(&:tag_id)
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ? LIMIT ?  [["user_id", 27], ["note_id", 3], ["LIMIT", 1]]
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "notes"."id" FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" LEFT OUTER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" LEFT OUTER JOIN "note_tags" ON "note_tags"."note_id" = "notes"."id" WHERE "favourites"."user_id" = ?  [["user_id", 27]]

  def add_favourite
    note = Note.find(params[:note_id])
    favourite = current_user.favourites.find_or_initialize_by(note: note)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "favourites".* FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ? LIMIT ?  [["user_id", 27], ["note_id", 3], ["LIMIT", 1]]

  def remove_favourite
    note = Note.find(params[:note_id])
    current_user.favourite_notes.delete(note)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "favourites" WHERE "favourites"."user_id" = ? AND "favourites"."note_id" = ?  [["user_id", 27], ["note_id", 5]]

  def show
    @note = Note.find(params[:id])
    @comment = Comment.new


    file_extension = @note.format

    google_id = 0
    google_drive_link = @note.google_drive_link

    if file_extension == ".pdf"
      google_id = google_drive_link.match(/\/file\/d\/(.+?)\//)[1]
    end

    if file_extension == ".docx"
      google_id = google_drive_link.match(/\/document\/d\/(.+?)\//)[1]
    end


    if user_signed_in?
      if (@visualizzazione = Visualizzazione.find_by(note_id: @note.id, user_id: current_user.id)) == nil
        @note.visualizzaziones.create(user: current_user)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "visualizzaziones".* FROM "visualizzaziones" WHERE "visualizzaziones"."note_id" = ? AND "visualizzaziones"."user_id" = ? LIMIT ?  [["note_id", 1], ["user_id", 24], ["LIMIT", 1]]
INSERT INTO "visualizzaziones" ("user_id", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 24], ["note_id", 1], ["created_at", "2023-09-01 08:52:58.134179"], ["updated_at", "2023-09-01 08:52:58.134179"]]

  def new
    @note = Note.new

    if params[:code] != nil
      current_user.update!(google_drive_refresh_token: params[:code])
---
UPDATE "users" SET "updated_at" = ?, "last_seen" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 09:24:09.581046"], ["last_seen", "2023-09-01 09:24:09.580619"], ["id", 24]]

  def create

    if params[:file_id] != nil && params[:file_name] != nil
      file_name = params[:note][:name]
      description = params[:note][:description]
      @note = Note.new(name: file_name, description: description)
      @note.user = current_user
      @note.tags = Tag.where(id: params[:note][:tag_ids])
      @note.topics = Topic.where(id: params[:note][:topic_ids])
      @note.format = File.extname(file_name)
      file_id = params[:file_id]

      begin

      temp_file = open("https://drive.google.com/uc?id=#{file_id}")
      path_file = temp_file.path

      session = GoogleDrive::Session.from_config("config.json")
      destination_folder = session.collection_by_url("https://drive.google.com/drive/folders/1zJPM2hoIzMzuvfefRvQM8NXHee5pOfhL?hl=it")



      uploaded_file = destination_folder.upload_from_file(path_file,file_name,convert: false)


      @note.faculty_id = params[:note][:faculty_id] unless params[:note][:faculty_id].blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 24], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ?  [["id", 3]]
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"
SELECT "topics".* FROM "topics"
SELECT "users".* FROM "users"

            render :new, alert: 'Si è verificato un errore durante il caricamento del file'
          end

          if @note.save
---
INSERT INTO "notes" ("name", "description", "created_at", "updated_at", "uploaded_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["created_at", "2023-06-29 14:56:35.838931"], ["updated_at", "2023-06-29 14:56:35.838931"], ["uploaded_at", "2023-06-29 14:56:35.838869"]]


      @note = Note.new(note_params)
      @note.user = current_user
      @note.tags = Tag.where(id: params[:note][:tag_ids])
      @note.topics = Topic.where(id: params[:note][:topic_ids])
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ?  [["id", 23]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ?  [["id", 20]]


          end

          if @note.save
---
INSERT INTO "notes" ("name", "description", "created_at", "updated_at", "google_drive_link", "uploaded_at", "user_id", "faculty_id", "format") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def download_file
    @note = Note.find(params[:id])
    @note.increment_download_count
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "notes" SET "updated_at" = ?, "downloads" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-01 08:54:14.343630"], ["downloads", 1], ["id", 2]]

  def update_rating
    @note = Note.find(params[:id])
    @user = User.find(@note.user.id)


    if (@create_rating = CreateRating.find_by(note_id: @note.id, user_id: current_user.id)) == nil
      @create_rating = CreateRating.create!(note_id: @note.id, user_id: current_user.id, rating: params[:note][:rating])

    else
      @create_rating.update(rating: params[:note][:rating])
    end



    average_rating = CreateRating.where(note_id: @note.id).average(:rating)
    @note.update(rating: average_rating)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT AVG("create_ratings"."rating") FROM "create_ratings" WHERE "create_ratings"."note_id" = ?  [["note_id", 3]]
SELECT "create_ratings".* FROM "create_ratings" WHERE "create_ratings"."note_id" = ? AND "create_ratings"."user_id" = ? LIMIT ?  [["note_id", 2], ["user_id", 24], ["LIMIT", 1]]
INSERT INTO "create_ratings" ("note_id", "user_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["note_id", 2], ["user_id", 24], ["rating", 4], ["created_at", "2023-09-04 15:19:08.372526"], ["updated_at", "2023-09-04 15:19:08.372526"]]
UPDATE "users" SET "updated_at" = ?, "last_seen" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 16:38:26.314752"], ["last_seen", "2023-09-01 16:38:26.313827"], ["id", 27]]
UPDATE "create_ratings" SET "rating" = ?, "updated_at" = ? WHERE "create_ratings"."id" = ?  [["rating", 5], ["updated_at", "2023-09-01 17:21:43.107171"], ["id", 43]]
UPDATE "notes" SET "updated_at" = ?, "rating" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-01 16:38:26.408186"], ["rating", 1], ["id", 3]]
SELECT AVG("create_ratings"."rating") FROM "create_ratings" WHERE "create_ratings"."note_id" = ?  [["note_id", 2]]
UPDATE "users" SET "updated_at" = ?, "rating" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-01 16:38:49.310428"], ["rating", 1], ["id", 15]]
UPDATE "notes" SET "updated_at" = ?, "rating" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-04 15:19:08.389097"], ["rating", 4], ["id", 2]]

  def setUserRating(user)
    sum_ratings = 0
      i = 0
      user.notes.each do |note|
        sum_ratings += note.rating
        i += 1
      end
      if i == 0
        i = 1
      end
      average_rating = sum_ratings / i

      user.update(rating: average_rating)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 25]]
UPDATE "users" SET "updated_at" = ?, "rating" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-03 17:22:12.629242"], ["rating", 2], ["id", 25]]

  def delete
    note = Note.find(params[:id])
    notetags = NoteTag.where(note_id: params[:id])
    notetags.delete_all
    notetopics = NoteTopic.where(note_id: params[:id])
    notetopics.delete_all
    favourites = Favourite.where(note_id: params[:id])
    favourites.delete_all
    createrating = CreateRating.where(note_id: params[:id])
    createrating.delete_all
    comments = Comment.where(note_id: params[:id])
    comments.delete_all
    views = Visualizzazione.where(note_id: params[:id])
    views.delete_all
    delete_G_Drive(note.google_drive_link)
    user = note.user
    note.delete
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
DELETE FROM "note_tags" WHERE "note_tags"."note_id" = ?  [["note_id", 7]]
DELETE FROM "note_topics" WHERE "note_topics"."note_id" = ?  [["note_id", 7]]
DELETE FROM "favourites" WHERE "favourites"."note_id" = ?  [["note_id", 7]]
DELETE FROM "create_ratings" WHERE "create_ratings"."note_id" = ?  [["note_id", 7]]
DELETE FROM "comments" WHERE "comments"."note_id" = ?  [["note_id", 7]]
DELETE FROM "visualizzaziones" WHERE "visualizzaziones"."note_id" = ?  [["note_id", 7]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 7]]

  def recenti
    @visualizzazioni_recenti = current_user.visualizzaziones.order(created_at: :desc).limit(10)
---
SELECT "visualizzaziones".* FROM "visualizzaziones" WHERE "visualizzaziones"."user_id" = ? ORDER BY "visualizzaziones"."created_at" DESC LIMIT ?  [["user_id", 27], ["LIMIT", 10]]

  def suggested
    favourite = current_user.favourite_notes.includes(:note_topics, :note_tags)
    favourite_topics = favourite.flat_map(&:note_topics).map(&:topic_id)
---
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" IN (?, ?)  [["note_id", 3], ["note_id", 5]]
SELECT "notes".* FROM "notes" INNER JOIN "favourites" ON "notes"."id" = "favourites"."note_id" WHERE "favourites"."user_id" = ?  [["user_id", 27]]
SELECT 1 AS one FROM "notes" INNER JOIN "note_topics" ON "note_topics"."note_id" = "notes"."id" INNER JOIN "note_tags" ON "note_tags"."note_id" = "notes"."id" WHERE (note_topics.topic_id IN (19,19) OR note_tags.tag_id IN (19,20)) AND "notes"."id" NOT IN (?, ?) AND "notes"."user_id" != ? LIMIT ?  [["id", 3], ["id", 5], ["user_id", 27], ["LIMIT", 1]]
SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" = ? ORDER BY "note_topics"."id" ASC LIMIT ?  [["note_id", 5], ["LIMIT", 1]]
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" = ? ORDER BY "note_tags"."id" ASC LIMIT ?  [["note_id", 5], ["LIMIT", 1]]

  def best
    @best_notes = Note.where("rating <= 5").order(rating: :desc)
    @topic_ids_union = []
    @tag_ids_union = []
    @notes_union = []

    @best_notes.each do |note|
      topic_id = note.note_topics.first.topic_id
      tag_id = note.note_tags.first.tag_id
---
SELECT "notes".* FROM "notes" WHERE (rating <= 5) ORDER BY "notes"."rating" DESC
SELECT "note_topics".* FROM "note_topics" WHERE "note_topics"."note_id" = ? ORDER BY "note_topics"."id" ASC LIMIT ?  [["note_id", 5], ["LIMIT", 1]]
SELECT "note_tags".* FROM "note_tags" WHERE "note_tags"."note_id" = ? ORDER BY "note_tags"."id" ASC LIMIT ?  [["note_id", 5], ["LIMIT", 1]]

  def edit
    @note = current_user.notes.find(params[:id])

    @tags = Tag.all
    @topics = Topic.all
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 24], ["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"
SELECT "topics".* FROM "topics"

  def update
    @note = current_user.notes.find(params[:id])
    if(params[:note][:tag_ids] != nil && params[:note][:topic_ids] && params[:note][:name].length > 0 && params[:note][:description].length > 0)
      if @note.update(note_params)
        @note.tags = Tag.where(id: params[:note][:tag_ids])
        @note.topics = Topic.where(id: params[:note][:topic_ids])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 24], ["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "description" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["description", "Lezione del corso di Ricerca Operativa riguardante i poliedri ,corso tenuto da Massimo Roma"], ["updated_at", "2023-09-04 15:23:51.132689"], ["id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "note_tags" ON "tags"."id" = "note_tags"."tag_id" WHERE "note_tags"."note_id" = ?  [["note_id", 1]]
SELECT "topics".* FROM "topics" INNER JOIN "note_topics" ON "topics"."id" = "note_topics"."topic_id" WHERE "note_topics"."note_id" = ?  [["note_id", 1]]

  def video_download
    @note = Note.find(params[:id])
    @note.increment_download_count
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "notes" SET "updated_at" = ?, "downloads" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-05 07:49:54.911557"], ["downloads", 2], ["id", 1]]