app/controllers/richiesta_admins_controller.rb

SELECT "richiesta_admins".* FROM "richiesta_admins"
---
  def index
    @richiesta_admins = RichiestaAdmin.all

INSERT INTO "richiesta_admins" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["content", "Salve desidero diventare un amministratore del vostro sito"], ["created_at", "2023-06-13 15:16:33.654945"], ["updated_at", "2023-06-13 15:16:33.654945"]]
---
  def create_richiesta_admin
    @richiesta_admin = current_user.richiesta_admins.new(user_id: current_user.id, content: 'Salve desidero diventare un amministratore del vostro sito')
    if @richiesta_admin.save

INSERT INTO "richiesta_admins" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 8], ["content", "Salve desidero diventare un Amministratore del vostro sito"], ["created_at", "2023-06-13 10:21:54.292626"], ["updated_at", "2023-06-13 10:21:54.292626"]]
---
  def create
    @richiesta_admin = current_user.richiesta_admins.new(richiesta_admin_params)

    respond_to do |format|
      if @richiesta_admin.save

SELECT "richiesta_admins".* FROM "richiesta_admins" WHERE "richiesta_admins"."user_id" = ? AND "richiesta_admins"."id" = ? LIMIT ?  [["user_id", 8], ["id", 16], ["LIMIT", 1]]
DELETE FROM "richiesta_admins" WHERE "richiesta_admins"."id" = ?  [["id", 16]]
---
  def destroy
    @richiesta_admin = current_user.richiesta_admins.find(params[:id])
    @richiesta_admin.destroy

SELECT "richiesta_admins".* FROM "richiesta_admins" WHERE "richiesta_admins"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_richiesta_admin
      @richiesta_admin = RichiestaAdmin.find(params[:id])