app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags" WHERE (name LIKE '%Transi%')
---
    def search
        @search_query = params[:tag]
        @search_result = Tag.where('name LIKE ?', "%#{@search_query}%")