app/controllers/topics_controller.rb

  def search
      @search_query = params[:topic]
      @search_result = Topic.where('name LIKE ?', "%#{@search_query}%")
---
SELECT "topics".* FROM "topics" WHERE (name LIKE '%Elett%')