app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%%' OR id = '')
---
  def search
    @search_query = params[:search]
    @search_result = User.where('username LIKE ? OR id = ?', "%#{@search_query}%", @search_query)

SELECT "create_ratings".* FROM "create_ratings" WHERE "create_ratings"."user_id" = ?  [["user_id", 27]]
DELETE FROM "create_ratings" WHERE "create_ratings"."id" = ?  [["id", 39]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 27]]
---
  def destroy
    begin
      prova(@user)
      createrating = CreateRating.where(user_id: @user.id)
      createrating.delete_all
      @user.destroy

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 27]]
---
  def prova(user)
    notes = Note.where(user_id: user.id)
    notes.each do |note|