app/models/note.rb

UPDATE "notes" SET "updated_at" = ?, "downloads" = ? WHERE "notes"."id" = ?  [["updated_at", "2023-09-01 08:54:14.343630"], ["downloads", 1], ["id", 2]]
---
    def increment_download_count
      self.downloads += 1
      self.save