app/models/user.rb

  def self.from_omniauth(auth)
    name_split = auth.info.name.split(" ")
    user = User.where(email: auth.info.email).first
    user ||= User.create!(provider: auth.provider, uid: auth.uid,username: name_split[0]+ ""+"ShareYourNotes", name: name_split[0], email: auth.info.email, password: Devise.friendly_token[0, 20])
    user.skip_confirmation!
    user.save!
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "grassopierluca@alice.it"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "username", "name", "confirmation_token", "confirmation_sent_at", "provider", "uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "confirmed_at" = ? WHERE "users"."id" = ?  [["updated_at", "2023-06-24 15:14:49.678522"], ["confirmed_at", "2023-06-24 15:14:49.678110"], ["id", 20]]