app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "grasso.1950186@studenti.uniroma1.it"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "google_drive_access_token" = ?, "google_drive_refresh_token" = ? WHERE "users"."id" = ?
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "confirmation_token", "confirmation_sent_at", "provider", "uid", "google_drive_access_token", "profile_img_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = ?  [["updated_at", "2023-09-05 08:22:09.637775"], ["username", "Pierluca#127"], ["id", 127]]
---
  def self.from_omniauth(auth)
    access_token = auth.credentials.token
    refresh_token = auth.credentials.refresh_token
    expires_at = auth.credentials.expires_at

    user_image = auth.info.image
    name_split = auth.info.name.split(" ")
    user = User.where(email: auth.info.email).first

    if user
      # Se l'utente esiste già, aggiorna i valori solo se sono cambiati
      if user.google_drive_access_token != access_token ||
         user.google_drive_refresh_token != refresh_token ||
         user.google_drive_expires_at != expires_at
        user.update!(
          google_drive_access_token: access_token,
          google_drive_refresh_token: refresh_token,
          google_drive_expires_at: expires_at,
          profile_img_url: user_image
        )
      end
    else
      # Se l'utente non esiste, creane uno nuovo con i valori forniti
      password = Devise.friendly_token[0, 20]
      user = User.create!(
        provider: auth.provider,
        uid: auth.uid,
        username: name_split[0] + "" + "ShareYourNotes" + auth.uid,
        name: name_split[0],
        email: auth.info.email,
        password: password,
        password_confirmation: password,
        google_drive_access_token: access_token,
        google_drive_refresh_token: refresh_token,
        google_drive_expires_at: expires_at,
        profile_img_url: user_image
      )
      user.skip_confirmation!
      user.save!