app/views/layouts/application.html.erb

                            var onlineStatus = document.createElement("span");
                            <% User.all.each do |user|%>
---
SELECT "users".* FROM "users"

                  </script>
                  <% users = User.all %>
---
SELECT "users".* FROM "users"

              <datalist id="name-suggestions">
                <% Note.distinct.pluck(:name).each do |name| %>
---
SELECT DISTINCT "notes"."name" FROM "notes"

                      <datalist id="username-suggestions">
                        <% User.joins(:notes).distinct.pluck(:username).each do |username| %>
---
SELECT DISTINCT "users"."username" FROM "users" INNER JOIN "notes" ON "notes"."user_id" = "users"."id"

                      <div id="faculty-choice" style="display: none;">
                        <%= select_tag :faculty, options_from_collection_for_select(Faculty.all, :id, :name, params[:faculty]), prompt: "Scegli una facoltà", class: "form-control", id: "faculty", style: "height: 2.5em;" %>
---
SELECT "faculties".* FROM "faculties"

                      <div id="topic-choice" style="display: none; height: 3.5em; overflow-y: auto; margin-left: 5%; background-color: white;">
                        <% Topic.distinct.pluck(:name).each do |topic| %>
---
SELECT DISTINCT "topics"."name" FROM "topics"

                      <div id="tag-choice" style="display: none; height: 3.5em; overflow-y: auto; margin-left: 5%; top: 1%; background-color: white;">
                        <% Tag.distinct.pluck(:name).each do |tag| %>
---
SELECT DISTINCT "tags"."name" FROM "tags"