app/views/layouts/application.html.erb

SELECT DISTINCT "name" FROM "note_topics"
SELECT DISTINCT "topics"."name" FROM "topics"
---
                <div id="topic-choice" style="display: none;">
                  <%= select_tag :topic, options_for_select(Topic.distinct.pluck(:name), params[:topic]), prompt: "Seleziona un topic", class: "form-control", id: "topic", value: params[:topic] || (params[:Filtro].try(:include?, 'topic') ? nil : valueTopic), multiple: true, size:2 %>

SELECT "faculties".* FROM "faculties"
---
                <div id="faculty-choice" style="display: none;">
                  <%= select_tag :faculty, options_from_collection_for_select(Faculty.all, :id, :name, params[:faculty]), prompt: "Seleziona una facoltà", class: "form-control", id: "faculty" %>

SELECT DISTINCT "tags"."name" FROM "tags"
---
                <div id="tag-choice" style="display: none;">
                  <%= select_tag :tag, options_for_select(Tag.distinct.pluck(:name), params[:tag]), prompt: "Seleziona un tag", class: "form-control", id: "tag", value: params[:tag] || (params[:Filtro].try(:include?, 'tag') ? nil : valueTag), multiple: true, size:2 %>